Hi, @Fuochi, thanks, I was able to pull v2.4.2.

Unfortunately, my problem still persists. After playing with the issue further, I can see that terraform-prowlarr-provider is failing to create an indexer resource. Here's full stdout output, although I could try and run with `TF_LOG=TRACE TF_LOG_PATH=tf.log` if that makes more sense, let me know.

<details>
<summary>Full stdout output</summary>

```
Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # prowlarr_indexer.toloka will be created
  + resource "prowlarr_indexer" "toloka" {
      + app_profile_id  = 1
      + config_contract = "TolokaSettings"
      + enable          = true
      + fields          = (sensitive value)
      + id              = (known after apply)
      + implementation  = "Toloka"
      + language        = (known after apply)
      + name            = "Toloka"
      + priority        = 0
      + privacy         = (known after apply)
      + protocol        = "torrent"
      + tags            = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.
╷
│ Warning: Resource targeting is in effect
│
│ You are creating a plan with the -target option, which means that the result of this plan may not represent all of the changes requested by the current configuration.
│
│ The -target option is not for routine use, and is provided only for exceptional situations such as recovering from errors or mistakes, or when Terraform specifically suggests to use it as part of an error message.
╵

Do you want to perform these actions?
  Terraform will perform the actions described above.
  Only 'yes' will be accepted to approve.

  Enter a value: yes

prowlarr_indexer.toloka: Creating...
╷
│ Warning: Applied changes may be incomplete
│
│ The plan was created with the -target option in effect, so some changes requested in the configuration may have been ignored and the output values may not be fully updated. Run the following command to verify that no other
│ changes are pending:
│     terraform plan
│
│ Note that the -target option is not suitable for routine use, and is provided only for exceptional situations such as recovering from errors or mistakes, or when Terraform specifically suggests to use it as part of an error
│ message.
╵
╷
│ Error: Provider produced inconsistent result after apply
│
│ When applying changes to prowlarr_indexer.toloka, provider "provider[\"registry.terraform.io/devopsarr/prowlarr\"]" produced an unexpected new value: .fields: inconsistent values for sensitive attribute.
│
│ This is a bug in the provider, which should be reported in the provider's own issue tracker.
```
</details>

If I intercept the request provider is making, then I see a valid 202 response:

![CleanShot 2024-08-07 at 21 40 50@2x](https://github.com/user-attachments/assets/a369d83a-2b3c-4568-8564-3ba146768f4f)


For context, the indexer I am testing with is semi-private, and requires a password, so it might be related.

